return {
    all = "全部",
    spring = "春",
    summer = "夏",
    autumn = "秋",
    winter = "冬",
    inside = "里",
    state1 = "祥瑞",
    state2 = "通常",
    state3 = "灾害",
    {
        name1 = "立春",
        subt1 = "万物复苏程度的天气",
        des1 = [[恢复§g100%§d生命值
立即获得§g3§d个随机裨益]],
        sp1 = [[有且仅有§b10§d倍权重在「春」的第一波出现]],
        other1 = [[立春至！(获得裨益)]],

        name2 = "雨水",
        subt2 = "回忆朦胧程度的天气",
        des2 = [[恢复§g20%§d生命值
弹幕有§g36%§d概率失去判定，变得透明
敌人(除boss外)有§b10%§d概率失去判定，变得透明
自机贴图透明度§r减半§d]],

        name3 = "惊蛰",
        subt3 = "春雷鸣动程度的天气",
        des3 = [[恢复§g15%§d生命值
屏幕上§r频繁出现闪电§d
闪电将§g杀死一切除boss外的敌人
闪电对boss造成§g25%生命上限§d的伤害
闪电对自机造成§r15点§d伤害]],

        name4 = "春分",
        subt4 = "万物平衡程度的天气",
        des4 = [[恢复§g50%§d生命值
如果生命值为满则额外获得§g15§d生命上限
随机获得§g2§d个已获得但未满级的道具
§-（若没有道具满足条件则升1级）]],
        sp4 = [[有且仅有§b10§d倍权重在「春」的最中间一波出现]],
        other4 = [[春分至！(获得道具)]],

        name5 = "清明",
        subt5 = "蜉蝣天地程度的天气",
        des5 = [[恢复§g10%§d生命值
弹幕贴图大小§b-50%§d，判定大小§g-35%
敌人贴图大小§b-50%§d]],

        name6 = "谷雨",
        subt6 = "茁壮成长程度的天气",
        des6 = [[恢复§g20%§d生命值
§g自机快速恢复生命值
经验获取倍率§g+50%]],

        name7 = "晴岚",
        subt7 = "风高气舒程度的天气",
        des7 = [[从屏幕左边不断吹入绿色米弹]],

        name31 = "霁雨",
        subt31 = "丁达尔效应程度的天气",
        des31 = [[弹幕判定大小§g-25%
弹幕附带§b拖尾效果]],

        name39 = "云樱",
        subt39 = "无理由绽放程度的天气",
        des39 = [[敌人死亡时在原地§r生成一朵樱花§d，§b60帧§d后向四周绽放
绽放后，樱瓣每§b30帧§d有§b15%§d概率消失]],

        name40 = "春雾",
        subt40 = "雾气氤氲程度的天气",
        des40 = [[屏幕上每§b60§d帧出现一片雾气区域，持续§r180帧]],

        name50 = "新阳",
        subt50 = "以伤为愈程度的天气",
        des50 = [[§r自机不再恢复生命值
损失生命值时将获得§g损失值25%§d的生命上限]],

        name51 = "云天",
        subt51 = "补充灵力程度的天气",
        des51 = [[攻击力§g+1.00
恢复生命值时将§g充能同等量的符卡槽]],

        name52 = "融雪",
        subt52 = "消融弹幕程度的天气",
        des52 = [[弹幕每§b34帧§d有§g1%§d的概率变成经验点]],

        name53 = "风絮云",
        subt53 = "友爱程度的天气",
        des53 = [[敌方弹幕对自机造成§g负值§d的伤害]],

        name54 = "羽云",
        subt54 = "轻浮程度的天气",
        des54 = [[敌人、经验点和弹幕将获得§b向上的加速度
移速提升§b50%§d]],
    },
    ---------------------------------
    {
        name8 = "立夏",
        subt8 = "万物繁茂程度的天气",
        des8 = [[自机获得§g当前生命值5%§d的生命上限
所有敌怪获得等同于§r自机生命值25%§d的生命上限]],
        sp8 = [[有且仅有§b10§d倍权重在「夏」的第一波出现]],

        name9 = "小满",
        subt9 = "满足刚需程度的天气",
        des9 = [[Wave开始时获得§g2§d个临时符卡槽，并§g充满所有符卡槽]],

        name10 = "芒种",
        subt10 = "播种期望程度的天气",
        des10 = [[恢复§g50%§d生命值
经验点将固定在原地，
且§r无法上线收取§d，经过§b900帧§d后经验点消失
每颗经验点每秒有§r9%§d概率翻倍]],

        name11 = "夏至",
        subt11 = "万物疯狂程度的天气",
        des11 = [[敌人生命上限§r+50%
敌人死亡时将额外掉落§g1§d颗经验点
经验获取倍率§g+25%]],
        sp11 = [[有且仅有§b10§d倍权重在「夏」的最中间一波出现]],

        name12 = "小暑",
        subt12 = "炎热无常程度的天气",
        des12 = [[自机§r持续流失生命§-(不会致死)
敌人生命上限§r+30%]],

        name13 = "大暑",
        subt13 = "三伏无常程度的天气",
        des13 = [[自机§r持续流失生命(不会致死)
敌人生命上限§g-23%]],

        name14 = "夏雨",
        subt14 = "雨水四散程度的天气",
        des14 = [[屏幕上方不断出现散弹和自机狙米弹]],

        name32 = "阵雨",
        subt32 = "选择困难程度的天气",
        des32 = [[所有升级额外§g增加一个选项]],

        name41 = "天气雨",
        subt41 = "休整再启航程度的天气",
        des41 = [[自机§g极速恢复生命值
血量上限§r不会增加]],

        name42 = "无云",
        subt42 = "望穿程度的天气",
        des42 = [[敌人死亡时有§b50%§d概率额外掉落§g1§d颗经验点
敌人生命上限§g-50%]],

        name55 = "荷风",
        subt55 = "吹拂扰动程度的天气",
        des55 = [[自机时不时§r向随机方向移动一段距离
移速提升§b25%]],

        name56 = "台风",
        subt56 = "移动不受控程度的天气",
        des56 = [[自机时不时§r向随机方向移动一大段距离
移速下降§r25%]],
        sp56 = "「夏」「秋」共有",

        name60 = "阴晴",
        subt60 = "弹幕随机程度的天气",
        des60 = [[弹幕生成时§g50%§d概率失去判定
每§b120帧§d，将弹幕的判定反转]],

        name61 = "积云",
        subt61 = "重叠程度的天气",
        des61 = [[小怪死亡时在原地§r重新复活
boss死亡时§r重新出现相同的boss
敌人生命上限§r+20%]],

        name67 = "晴朗",
        subt67 = "无事发生程度的天气",
        des67 = [[§g自机将不会死亡
不会出现Hard Wave、Lucky Wave和Boss Wave]],
    },
    ----------------------------------------
    {
        name15 = "立秋",
        subt15 = "万物消长程度的天气",
        des15 = [[敌人生命上限随机变为原来的§b10%~200%§d
升级时有§g50%§d概率额外升1级]],
        sp15 = [[有且仅有§b10§d倍权重在「秋」的第一波出现]],

        name16 = "处暑",
        subt16 = "炎热消持程度的天气",
        des16 = [[自机生命值高于生命上限的§b50%§d时§r持续流失生命
否则§g快速恢复生命值]],

        name17 = "白露",
        subt17 = "秋高气爽程度的天气",
        des17 = [[敌人死亡时将掉落§g1§d颗露珠
自机吸收露珠时恢复§g0.3%生命上限§d的生命值]],

        name18 = "秋分",
        subt18 = "万物沉稳程度的天气",
        des18 = [[敌人移速§b下降25%§d
升级时有§g25%§d概率随机获得1个道具]],
        sp18 = [[有且仅有§b10§d倍权重在「秋」的最中间一波出现]],
        other18="秋分至！(获得加成)",

        name19 = "寒露",
        subt19 = "稗谷丰盈程度的天气",
        des19 = [[敌人死亡时向随机方向爆出§r0~4§d颗拥有重力的米弹，
天上不断掉落§y经验点]],

        name20 = "霜降",
        subt20 = "深秋微寒程度的天气",
        des20 = [[所有敌方子弹附带一层白边
自机每被击中时，移速§r下降25%§-(Wave结束时恢复)]],

        name21 = "谷物雨",
        subt21 = "丰收祈福程度的天气",
        des21 = [[弹幕判定大小§r+5%
所有弹幕贴图§b变为红、橙、黄色米弹]],

        name35 = "鳞云",
        subt35 = "守矩程度的天气",
        des35 = [[弹幕仅能往坐标轴的正负方向移动]],

        name43 = "秋老虎",
        subt43 = "回光返夏程度的天气",
        des43 = [[自机§r持续掉血]],

        name44 = "秋实",
        subt44 = "弹幕成熟程度的天气",
        des44 = [[被弹时，获得§g1.5§d生命上限]],

        name45 = "绯空",
        subt45 = "欢撒收获程度的天气",
        des45 = [[获得§g5§d生命上限
敌人死亡时爆出§r开花弹]],

        name57 = "台风",
        subt57 = "移动不受控程度的天气",
        des57 = [[自机时不时§r向随机方向移动一大段距离
移速下降§r25%]],
        sp57 = [[「夏」「秋」共有]],

        name58 = "卷云",
        subt58 = "包裹程度的天气",
        des58 = [[每当消弹时，有10%概率生成1颗经验点]],

        name59 = "社日",
        subt59 = "全属性提升程度的天气",
        des59 = [[生命值§g恢复至满
获得§g5§d生命上限
充满§g所有符卡槽
主炮射速§g+10
判定点大小§r+2
攻击力、移速、弹速提升§g50%]],

        name66 = "秋霜",
        subt66 = "枫叶残红程度的天气",
        des66 = [[敌人死亡时会喷洒枫叶，屏幕震动]],
    },
    ----------------------------------------
    {
        name22 = "立冬",
        subt22 = "万物休养程度的天气",
        des22 = [[恢复血量时§r不恢复血量§d，而是转化为§r12%§d的生命上限
敌人移速下降§b25%]],
        sp22 = [[有且仅有§b10§d倍权重在「冬」的第一波出现]],

        name23 = "小雪",
        subt23 = "冷涩凝绝程度的天气",
        des23 = [[弹幕每§b10帧§d有§b2%§d的概率停顿在原地，Wave结束时被清除
敌人移速§b下降25%]],

        name24 = "大雪",
        subt24 = "凛冬将至程度的天气",
        des24 = [[屏幕上方将§r不断飞落点弹
除点弹外的弹幕消失时将爆出§r1~3§d颗拥有重力的点弹
敌人移速§b下降33%]],

        name25 = "冬至",
        subt25 = "万物清平程度的天气",
        des25 = [[Wave开始时§g升1级
所有类型的弹幕§g一出现就会消失]],
        sp25 = [[有且仅有§b10§d倍权重在「冬」的最中间一波出现]],

        name26 = "小寒",
        subt26 = "迷雾冰滑程度的天气",
        des26 = [[在屏幕上不断§r生成一片迷雾区域
在迷雾区域内，
自机移速下降§r80%§d，敌人和子弹移速下降§r55%]],

        name36 = "瑞雪",
        subt36 = "祥瑞美满程度的天气",
        des36 = [[屏幕上方§g不断飘落经验点
升级时出现3&4级道具的概率§g大大提升]],

        name37 = "钻石尘",
        subt37 = "受击既死程度的天气",
        des37 = [[进入此天气时记录一次当前的生命值
被弹&体术时§r扣除等同于记录值的生命值]],

        name46 = "冻雨",
        subt46 = "碎碎冰程度的天气",
        des46 = [[敌人生命上限§g-25%
敌人死亡时§r向自机发射弹链]],

        name68 = "大寒",
        subt68 = "雨雪霏霏程度的天气",
        des68 = [[敌人死亡时§r生成1颗无法被消弹的中玉
中玉将慢慢向着自机方向移动，天气结束后再消除
每当攻击敌人时，有25%概率§r生成1颗点弹
敌人移速下降§b55%]],

        name69 = "春雪",
        subt69 = "异变程度的天气",
        des69 = [[自机持续获得§y「樱花结界」
下一个季节一定是§p「春」]],
        sp69 = [[有且仅有§b4§d倍权重在「冬」的最后一波出现
拥有§y「樱花结界」§d时权重上升§g4§d倍]],

        name70 = "暴风雪",
        subt70 = "视野受限程度的天气",
        des70 = [[屏幕上方不断§r飘落点弹和中玉
除自机周围的区域外，其余区域§r被大片风雪覆盖]],

        name71 = "结寒",
        subt71 = "躲避过错程度的天气",
        des71 = [[自机有§g50%§d概率闪避被弹&体术伤害
移速§r下降50%]],

        name72 = "花云",
        subt72 = "奇观程度的天气",
        des72 = [[自机和敌人周围不断出现经验点，§b60帧§d后消失
出现Boss§y「莉莉白」§d，击破后掉落一个§g3~4§d级道具]],

        name73 = "霜华",
        subt73 = "满天寒霜程度的天气",
        des73 = [[自机擦弹时，在弹幕处有§r40%§d概率生成1块冰块
在冰块内自机移速为§r0
冰块持续§b60帧§d，同屏最多存在§b100§d个冰块
冰块融化后变为§r0~1§d颗点弹，
并有§g30%§d概率掉落§g1§d颗经验点]],

        name74 = "冰云",
        subt74 = "结冰程度的天气",
        des74 = [[主炮子弹每帧有§r0.3%§d的概率被冻结成冰块
在冰块内自机移速为§r0
冰块持续§b60帧§d，同屏最多存在§b100§d个冰块
冰块融化后变为§r0~1§d颗点弹，
并有§g30%§d概率掉落§g1§d颗经验点]],
    },
    --------------------------------------
    {
        name27 = "蜃境",
        subt27 = "身临幻境程度的天气",
        des27 = [[敌机子弹发射时§b贴图发生随机变化
但判定大小不变]],

        name28 = "彼世",
        subt28 = "死后皆空程度的天气",
        des28 = [[场上所有物体§b失去判定
非时符符卡和非符倒计时§b大幅减少]],

        name29 = "狂气",
        subt29 = "精神疯狂程度的天气",
        des29 = [[敌人子弹和敌人的速度提升§b100%
自机移动速度提升§b100%]],

        name30 = "漩涡",
        subt30 = "旋转不停程度的天气",
        des30 = [[屏幕上所有物体获得以屏幕中心为中心的旋转速度]],

        name33 = "绀药",
        subt33 = "绝对完美程度的天气",
        des33 = [[自机受击时§r立即从当前波重新开始
若自机因流失生命而死亡，也§r从当前波重新开始]],

        name34 = "逆转",
        subt34 = "气天的度程转逆",
        des34 = [[自机操作§r反向]],

        name38 = "X",
        subt38 = "未知程度的天气",
        des38 = [[随机获得§g5§d个临时道具]],
        other38_1 = [[获得道具]],
        other38_2 = [[失去道具]],

        name47 = "裨益日",
        subt47 = "满眼只有裨益程度的天气",
        des47 = [[屏幕上方不断掉落可被拾取的§y【裨益】
但其不能上线收取
升级时只有§y【裨益】§d选项]],

        name48 = "交易日",
        subt48 = "满眼只有交易程度的天气",
        des48 = [[屏幕上方不断掉落可被拾取的§p【交易】
但其不能上线收取
升级时只有§p【交易】§d选项]],

        name49 = "侵害日",
        subt49 = "满眼只有侵害程度的天气",
        des49 = [[屏幕上方不断掉落可被拾取的§r【侵害】
但其不能上线收取
升级时只有§r【侵害】§d选项]],

        name62 = "幻玉",
        subt62 = "红烧程度的天气",
        des62 = [[所有子弹被替换为蓝色大玉，§g但为点弹判定]],

        name63 = "浮月",
        subt63 = "低重力程度的天气",
        des63 = [[弹幕、敌人和经验点获得§b向上的加速度]],

        name64 = "浮日",
        subt64 = "高重力程度的天气",
        des64 = [[弹幕、敌人和经验点获得§b向下的加速度]],

        name65 = "阴阳",
        subt65 = "虚实互融程度的天气",
        des65 = [[弹幕有§b50%§d失去判定
点击§-低速键§d时，将弹幕的判定§b反转]],

        name75 = "极光",
        subt75 = "未知天气程度的天气",
        des75 = [[随机模仿一种天气]],

        name76 = "X*2",
        subt76 = "未知*2程度的天气",
        des76 = [[随机获得§g10§d个临时道具]],

        name77 = "abs(X)",
        subt77 = "魅知之旅程度的天气",
        des77 = [[随机获得§g5§d个道具]],
        sp77 = [[仅当通关§p挑战1§d才能抽取到此天气]],

        name78 = "亡雨",
        subt78 = "百鬼夜行程度的天气",
        des78 = [[屏幕上不断出现§r横行的鬼魂§d，阻挡子弹]],

        name79 = "流星雨",
        subt79 = "向星许愿程度的天气",
        des79 = [[屏幕上方不断出现星星坠落
开始时掉落一个§y4级道具§d]],
        sp79 = [[仅当获得§y天星之沐愿§d中任何一种才能抽取到此天气]]
    },

}
