return {
    [1] = {[[欢迎下载东方Roguelike！]], [[初次打开§p东方Roguelike]]},
    [11] = {[[挑战43：大量过牌！]], [[在游戏内获得一个道具]]},
    [17] = {[[梦想启航]], [[完成§b「雾之湖」§d的教程]]},
    [18] = {[[浴火之璀璨]], [[死亡§p1§d次]]},
    [19] = {[[天气之子]], [[完成§b「静海」§d的教程]]},
    [20] = {[[灵梦的一小步]], [[将§r灵梦§d升至§p2§d级]]},
    [21] = {[[魔理沙的一大步]], [[将§y魔理沙§d升至§p2§d级]]},
    [22] = {[[梦想天天生]], [[将§r梦想封印§d升至§p2§d级]]},
    [23] = {[[一发入魔]], [[将§p魔炮§d升至§p2§d级]]},
    [24] = {[[手揣希望]], [[解锁第§p2§d个初始携带槽]]},
    [25] = {[[平平无奇]], [[游玩时长达到§g114513§d秒
§-下一秒意义重大]]},
    [26] = {[[贤者时间]], [[游玩时长达到§g114515§d秒
§-上一秒意义重大]]},
    [27] = {[[买一送一！]], [[累计获得§p2§d个成就]]},
    [28] = {[[第一发！]], [[累计供奉§p1§d次]]},
    [29] = {[[第二发！]], [[累计供奉§p2§d次]]},
    [30] = {[[我觉得可以停下了]], [[累计供奉§p3§d次]]},
    [31] = {[[这是什么？！]], [[累计获得§p1§d颗供奉珠]]},
    [32] = {[[小小的梦想]], [[累计获得§p10§d颗供奉珠]]},
    [33] = {[[小小的任务官]], [[累计完成§p1§d个任务]]},
    [124] = {[[我来当主角！]], [[将§c琪露诺§d升至§p2§d级]]},
    [125] = {[[大无语事件！]], [[将§r射命丸文§d升至§p2§d级]]},
    [132] = {[[这不是我们的季节解放吗]], [[将§c小小冰镇世界§d升至§p2§d级]]},
    [133] = {[[超级闪光灯]], [[将§y暴力取材§d升至§p2§d级]]},

    [2] = {[[垃圾肉鸽，迟早药丸！]], [[暴力退出游戏
§-非工业制取呜呜呜块]]},
    [3] = {[[累了吗？休息一会儿吧]], [[游玩时长达到§p30§d分钟]]},
    [7] = {[[小小的资本]], [[拥有§y10000§d资金力]]},
    [12] = {[[Lucky STGer]], [[遇见过1次§gLucky Wave]]},
    [13] = {[[魔鬼的交易]], [[拾取掉落的道具后选择§p交易]]},
    [14] = {[[经验+5]], [[在1场游戏内，升至§p5§d级]]},
    [34] = {[[谁家小孩？]], [[遇到§y清明§d天气
§-小小的也很可爱]]},
    [35] = {[[你好，我也好]], [[将§r灵梦§d升至§p10§d级]]},
    [36] = {[[我的蘑菇哪儿去了？]], [[将§y魔理沙§d升至§p10§d级]]},
    [37] = {[[梦想被封印后只有幻想了]], [[将§r梦想封印§d升至§p7§d级]]},
    [38] = {[[超亮手电筒]], [[将§p魔炮§d升至§p7§d级]]},
    [39] = {[[为什么你还在这里？]], [[解锁第§p3§d个初始携带槽]]},
    [40] = {[[度帧如年]], [[一局游戏的时长达到3650帧
§-1.01388888]]},
    [41] = {[[刚刚开始！]], [[累计获得§p18§d个成就]]},
    [42] = {[[我爱你，你不爱我]], [[被敌人体术致死
§-爱的抱抱]]},
    [43] = {[[BossRush,but Rougelike]], [[遇见1次「酒石酸唑吡坦」]]},
    [44] = {[[东方琴鼓歌,but Rougelike]], [[遇见1次「阿波罗13的捏造」]]},
    [45] = {[[小试身手]], [[通关「雾之湖」的§bNormal§d难度]]},
    [46] = {[[小试牛刀]], [[通关「静海」的§bNormal§d难度]]},
    [47] = {[[算了，第十发！]], [[累计供奉§p10§d次]]},
    [48] = {[[滴定道具池]], [[通过供奉获得§p1§d个道具]]},
    [49] = {[[你为何离我而去？]], [[累计§p100§d颗经验点未收集]]},
    [50] = {[[热死了（恼）]], [[因§r秋老虎§d天气而死亡
§-好热好热好热]]},
    [51] = {[[颂德道士今尚在]], [[遇见1次§b幻玉§d天气
§-天文的第一颗大玉]]},
    [52] = {[[我看你是……什么都不懂哦]], [[累计完成§p7§d个任务]]},
    [126] = {[[可可爱爱没有脑袋]], [[将§c琪露诺§d升至§p10§d级]]},
    [127] = {[[当时觉得很有趣就拍下来了]], [[将§r射命丸文§d升至§p10§d级]]},
    [134] = {[[cccc就完了]], [[将§c小小冰镇世界§d升至§p7§d级]]},
    [135] = {[[这不是我们的1.0PV吗]], [[将§y暴力取材§d升至§p7§d级]]},

    [4] = {[[1小时！！！]], [[游玩时长达到§p1§d小时]]},
    [53] = {[[人造小太阳]], [[用§-便携式隙间§d在短时间内传送§p5§d次
§-喜欢玩量子隧穿？]]},
    [54] = {[[闲得慌]], [[在主菜单长按十秒鼠标
§-烟花、很好看吧）]]},
    [55] = {[["削弱灵梦"]], [[将§r灵梦§d升至§p15§d级]]},
    [56] = {[["加强魔理沙"]], [[将§y魔理沙§d升至§p15§d级]]},
    [57] = {[[梦想的期望伤害是...]], [[将§r梦想封印§d升至§p10§d级]]},
    [58] = {[[Master!! Spark!!!]], [[将§p魔炮§d升至§p10§d级]]},
    [59] = {[[赢在起跑线]], [[解锁第§p4§d个初始携带槽]]},
    [60] = {[[是不是有些太多了？]], [[累计获得§p45§d个成就]]},
    [61] = {[[耐冻王]], [[在§r暴风雪§d天气下无伤通过1波]]},
    [62] = {[[天打雷劈！]], [[在§r惊蛰§d天气下被雷劈死1次
§-人形避雷针]]},
    [63] = {[[偷天换日变成0了]], [[§-偷天换日§d将4级道具偷换为其他道具
§-20%中全是诈骗]]},
    [64] = {[[舞蹈的白色结晶]], [[在§r霜降§d天气下存在超过§p10§d颗大玉
§-霜寒下的三原色合成]]},
    [65] = {[[新世界！]], [[解锁「静海」场景
§-The New World]]},
    [66] = {[[原初的节拍]], [[获得2个§b妖怪测谎仪§d后，一秒内按低速键超过12次
§-美丽的高低切]]},
    [67] = {[[宝贝、出金啦！]], [[通过供奉获得§p1§d个任意角色的天赋]]},
    [68] = {[[100ml容量瓶]], [[通过供奉获得§p10§d个道具]]},
    [69] = {[[大风起兮云飞扬]], [[在§r台风§d天气下无伤通过1波]]},
    [70] = {[[爆金币了]], [[在一波内获得§p3§d颗及以上的供奉珠]]},
    [71] = {[[样一了家到回像觉感]], [[获得§-天地有用§d后遇见§r逆转§d天气
§-天气无用，天地有用]]},
    [72] = {[[还好我是体育生]], [[生命上限超过§p100]]},
    [73] = {[[萎靡不振]], [[§p绯红的专注§d的m>=9时§r受击
§-全屏开花只是个梦吗]]},
    [74] = {[[你还活着吗？？]], [[生命上限小于等于§p0.01]]},
    [75] = {[[全身瘫痪]], [[高速移速小于等于§p0.01]]},
    [76] = {[[浓缩的都是精华]], [[判定点大小小于等于§p0.01]]},
    [77] = {[[宇宙同璀璨]], [[获得§p活力的繁星§d后场上的星星大于§p195§d颗
§-扶疏万物影]]},
    [78] = {[[于是忘了得了阿尔兹海默症]], [[用光§p九代稗谷§d的复活次数
§-得了阿尔兹海默症？]]},
    [79] = {[[记忆恢复术]], [[累计完成§p15§d个任务]]},
    [80] = {[[我先睡了]], [[在「酒石酸唑吡坦」中死亡
§-安详地安眠了]]},
    [81] = {[[黄泉的樱之国]], [[在§r云樱§d天气下死亡
§-死后血跃花]]},
    [82] = {[[震惊幻想乡]], [[在§b秋霜§d天气下死亡
§-原来自机也是Boss]]},
    [120] = {[[这就是黑手]], [[因§p恐慌的笼罩§d流失生命而死亡
§-为了杀敌奋不顾身]]},
    [128] = {[[你骂谁呢]], [[将§c琪露诺§d升至§p15§d级]]},
    [129] = {[[没想到火了]], [[将§r射命丸文§d升至§p15§d级]]},
    [136] = {[[冰河世纪]], [[将§c小小冰镇世界§d升至§p10§d级]]},
    [137] = {[[全屏拍照要算分吗]], [[将§y暴力取材§d升至§p10§d级]]},
    [140] = {[[游行的手柄按钮]], [[通关挑战1]]},

    [5] = {[[我草？你玩半天了？]], [[游玩时长达到§p12§d小时]]},
    [8] = {[[小康社会]], [[拥有§y40000§d资金力]]},
    [15] = {[[杂鱼的末日]], [[连续释放§p2§d次符卡]]},
    [16] = {[[进化之地]], [[累计完成§p30§d个任务]]},
    [83] = {[[感觉像回到家了一样]], [[在§r绀药§d天气下遇见§r流星雨
§-完美无缺的六道中]]},
    [84] = {[[感觉像回到家了一样2.0]], [[在「静海」中chaos达到§r150%
§-东方绀珠传Lunatic难度]]},
    [85] = {[[感觉像回到家了一样3.0]], [[无伤通过§r"彩虹五吴克"
§-难道五只不行？]]},
    [86] = {[[姐就是女王]], [[拥有17个§p大促销：神子牌令牌
§-自信放光芒]]},
    [87] = {[[我将以高达形态出击]], [[解锁所有的初始携带槽]]},
    [88] = {[[赤色杀人魔]], [[将§r灵梦§d升至§p20§d级]]},
    [89] = {[[黑白蘑菇馍]], [[将§y魔理沙§d升至§p20§d级]]},
    [90] = {[[原色空間]], [[在§r晴岚§d天气下遇见§r流星雨
§-RGB弹幕]]},
    [91] = {[[我觉得有些太多了……]], [[累计获得§p75§d个成就]]},
    [92] = {[[偷天换日变成1了]], [[§-偷天换日§d将0级道具偷换为4级道具
§-真正的偷天换日，多试试！]]},
    [93] = {[[不忘初心]], [[通关「雾之湖」的§rExtra§d难度]]},
    [94] = {[[季节之神的化身]], [[通关「静海」的§rExtra§d难度]]},
    [95] = {[[完全体灵梦]], [[获得§r灵梦§d的所有天赋]]},
    [96] = {[[完全体魔理沙]], [[获得§y魔理沙§d的所有天赋]]},
    [97] = {[[1mol道具]], [[通过供奉获得所有道具]]},
    [98] = {[[迪厅]], [[在§r旋涡§d天气下遇见§r"光之女皇"
§-旋转的迪斯科]]},
    [99] = {[[回家了，但是是另一个家]], [[在§r绀药§d天气下遇见§r"二叉树"
§-东方妖怪小町]]},
    [100] = {[[幻觉之玉]], [[在§b幻玉§d天气下遇见§r"光之女皇"
§-2^63种大玉]]},
    [101] = {[[纯粹的狂气]], [[在§r狂气§d天气下遇见§r"心之所在"
§-*狂气升上了纯粹的天堂]]},
    [102] = {[[最强大脑]], [[收取辉夜的§r"五难题"§d符卡各一次]]},
    [103] = {[[20XX年 永生之旅]], [[在「Bacanoo!」中被弹§r5§d次
§-酒精依赖性]]},
    [104] = {[[你真的喝了？]], [[在§r积云§d天气下遇见「Bacanoo!」
§-九九成！稀罕物！]]},
    [105] = {[[斗转星移]], [[在§r霁雨§d天气下遇见「斗转星移的环带」
§-丁达尔的星带]]},
    [106] = {[[盐明珠]], [[集齐3个带有§y"RGB"§d标签的道具
§-东方海惠堂]]},
    [107] = {[[秦始皇还未成年]], [[在§y清明§d天气下遇见§r"雷霆乍惊，宫车过也"
§-宫车也未成年]]},
    [108] = {[[拉去坐牢]], [[在§y清明§d天气下遇见"绿云扰扰，梳晓鬟也"
§-触犯秦法]]},
    [121] = {[[乱玩谐音梗]], [[在§r晴岚§d天气下遇见§b清兰
§-这样子谐音？]]},
    [122] = {[[完全体⑨]], [[获得§c琪露诺§d的所有天赋]]},
    [123] = {[[完全体文文]], [[获得§r射命丸文§d的所有天赋]]},
    [130] = {[[感觉不如......黑皮琪露诺]], [[将§c琪露诺§d升至§p20§d级]]},
    [131] = {[[媒体现状]], [[将§r射命丸文§d升至§p20§d级]]},
    [139] = {[[冰者不能自冰]], [[使用琪露诺通关挑战5]]},
    [141] = {[[纪念碑谷]], [[通关挑战2]]},
    [142] = {[[霜华满天]], [[通关挑战5]]},
    [143] = {[[妖怪山车神]], [[通关挑战6]]},
    [147] = {[[fashion is coming]], [[集齐全部样式的§p死宛宝宝]]},
    [148] = {[[th20]], [[在§y流星雨§d天气下遇见§r流星雨
§-东之国夏夜的绀珠 ~ Meteor Shower Simulation of Meteor Shower]]},
    [149] = {[[月球是奶酪做的]], [[§y护守之莲§d和§b向侧之月§d同框
§-魔理沙见不得这个]]},
    [150] = {[[纵使相逢应不识，尘满面，鬓如霜]], [[chaos高于100%时，一波内§b向侧之月§d没有缩小
§-料得年年肠断处，明月夜，短松冈]]},
    [151] = {[[可爱包包，Ciallo ~ ]], [[集齐全部样式的§p豆包
§-只要负责可爱就好了]]},

    [6] = {[[玩了1天，感动中国]], [[游玩时长达到§p24§d小时]]},
    [9] = {[[阔  绰]], [[拥有§y80000§d资金力]]},
    [109] = {[[物理学不存在了]], [[通关§yExtra§d时，chaos没有高于§r100%]]},
    [110] = {[[大人物们的杰作]], [[通关「雾之湖」的§rUltra§d难度]]},
    [111] = {[[妖精们加快速度！]], [[通关「静海」的§rUltra§d难度]]},
    [112] = {[[奖励：成就感逐渐消失]], [[累计获得§p100§d个成就]]},
    [113] = {[[致命的毒药]], [[无伤通过梅蒂欣]]},
    [114] = {[[境界的彼方]], [[无伤通过八云紫]]},
    [115] = {[[纯粹的世界]], [[无伤通过纯狐]]},
    [138] = {[[我就是神金]], [[使用射命丸文通关挑战6]]},
    [144] = {[[一尺之蛇，日增其半]], [[通关挑战3]]},
    [146] = {[[团子是我的了]], [[无伤通过铃瑚]]},

    [10] = {[[太好玩莉]], [[连续§y7§d天登录游戏]]},
    [116] = {[[忆一世]], [[游玩时长达到§g114514§d秒
§-完  全  胜  利]]},
    [117] = {[[V]], [[获得所有成就]]},
    [118] = {[[湖面征服者]], [[无伤通关「雾之湖」的§rUltra§d难度]]},
    [119] = {[[月亮之上]], [[无伤通关「静海」的§rUltra§d难度]]},
    [145] = {[[好好好你是1]], [[通关挑战4]]},


}