return {
    ["正体不明的X"] = "正体不明的X",
    des1 = [[chaos初始为§r12.5%§d
§r角色升级不能选择加成§d，但会增加§g5§d生命上限
含有§b天气系统§d，天气固定为§yX*2§d]],
    ["测测你的"] = "测测你的",
    des2 = [[§r自机无法射击，角色升级不能选择加成§d；§y不会出现boss wave
每升两级，会获得1个§b妖怪测谎仪§d
初始携带1个§b妖怪测谎仪§d，1个§p宝塔的神光]],
    ["贪吃蛇"] = "贪吃蛇",
    des3 = [[初始携带3个§-幽灵沙包§d，1个§p喜爱者
每升1级，获得1个§-幽灵沙包§d]],
    ["好了知道你是0了"] = "好了知道你是0了",
    des4 = [[第34号苦痛之路。请享受苦参的回廊。
初始携带所有除§-分子重组仪§d外的0级道具
含有§b天气系统§d]],
    ["尘肺病"] = "尘肺病",
    des5 = [[含有§b天气系统§d，天气固定为§r钻石尘§d]],
    ["我是地质学家，这就是神金"] = "我是地质学家，这就是神金",
    des6 = [[初始携带3个§g光学迷彩服
含有§b天气系统§d，天气固定为§r狂气§d
§r禁止低速移动]],
    ["打妖精"] = "打妖精",
    des7 = [[使用§y鼠标§d操控自机，§r自机停止所有行为§d，初始携带§y贪欲的敛财
使用鼠标§y左键§d对屏幕上的敌人进行小范围打击，并且消除弹幕
含有§b天气系统§d]],
    ["东方游戏手机版"] = "东方游戏手机版",
    des8 = [[使用§y鼠标§d操控自机
含有§b天气系统§d]],
    ["蓬莱之药"] = "蓬莱之药",
    des9 = [[随着游玩进展，游戏速度从§c2倍速§d降至§c0.25倍速§d
含有§b天气系统§d]],
    ["诶，我有一年之计"] = "诶，我有一年之计",
    des10 = [[chaos初始为§r36.5%§d
自机移动时，游戏速度逐渐升至§c6倍速§d；不移动时，游戏速度逐渐降至§c0倍速
含有§b天气系统§d]],
    ["收起你的小霁霁"] = "收起你的小霁霁",
    des11 = [[全屏自带§r高强度拖影效果
含有§b天气系统§d]],
    ["注意力不集中"] = "注意力不集中",
    des12 = [[视野§r放大一定倍率§d，自动跟踪于§p弹幕较多的区域
含有§b天气系统§d]],
    ["注意力集中"] = "注意力集中",
    des13 = [[视野§r放大一定倍率§d，自动跟踪于§p玩家位置
含有§b天气系统§d]],
    ["引力超大的(魔理沙)"] = "引力超大的(魔理沙)",
    des14 = [[chaos增长速度§g极慢§d，初始携带6个§g吸血鬼之牙
玩家对场上的弹幕和物品有极大的§r引力
含有§b天气系统§d]],
    ["东方弹幕风"] = "东方弹幕风",
    des15 = [[游戏速度随着obj数的增多而逐渐§c降低
按§y空格键§d加速游戏
含有§b天气系统§d]]
}