--update_ch.lua
return {
    [[
================================================
下载(更新)成功！大家好！这里是吃药图书。
这次游戏的制作有§p@清酒§d的鼎力相助，让整个游戏内容更加完善和平衡，非常感谢！

感谢大家一路以来的支持与关注，我们会努力把游戏做得更好的！
================================================
目前版本：v1.3.0
新增：
新增场景三[青空之影]!!!
新增游戏模式[路径模式]!!!
新增主动道具!!!
新增初始携带道具的预设储存与读取功能!!!
新增自机[十六夜咲夜]、[东风谷早苗]、[魂魄妖梦]
新增挑战[打妖精]、[东方游戏手机版]、[蓬莱之药]等
新增道具[彼时结界]等
新增天气[]等
新增若干成就

修改：
修复了天气[流星雨]遇到某种弹幕会报错的bug
修复了天气[极光]模仿[绀药]导致游玩出现问题的bug
修复了生命上限为"0"时道具[EXHP]触发时报错的bug
修复了[琪露诺]连续放bomb时符卡充能效率变成负的bug
修正了道具[平安喜乐][佛的御石钵]的标签
修正了道具[水獭灵的帮助]的名称
修正了道具[恐慌的笼罩]的描述
]]
}