return {
    classical = "§g传统模式§d",
    pathlike = "§c路径模式§d",
    weaSys = "§b§W天气系统§d",
    scene1 = "1.雾之湖",
    scene1_des = [[
妖怪之山山脚的大湖。
雾之湖湖畔青草依依，绿树成荫，湖上弥漫的雾气也会将岸边笼罩起来。

这里的妖精很多，但已让人司空见惯。
或许还能遇到一些古怪的、自大的、罕见的"大人物"。？]],
    scene2 = "2.静海",
    scene2_des = [[
不含有任何杂质的月之风无声的使海面荡起波纹。
除了风以外再没有其他搅乱水面的事物。眼前的海中没有任何生物栖息。吗？

寂静之海中，漂浮着机械的残骸和人类的旗帜，
代表了沉睡在这里属于污秽的人类的梦想。]],
    scene3 = "3.青空之影",
    scene3_des = [[
据说，云的缝隙中有不可思议的船在空中飞行。
那艘船在云间穿行着，似乎在寻找着什么。

天际，空色的架构已经明晰；云山摛锦，朝露漙漙。
极空之下，是步步为营的穹笼。
]],
}